[
      {
        "id": "1",
        "name": "Eng. MAHGOUB ALGAZOLI",
        "title": "General Manager",
        "quote": "We aim to be No. one company in customer satisfaction by striving to create \"inspiring the next\" with the pursuit of creativity and technical expertise",
        "phone": "+966542831681",
        "email": "mahgoub.algazoli@amakentransport.com",
        "paragraph": "<p>Eng. Mahgoub Algazoli is the General Manager of Amaken Transport Company. One of the leading national freight forwarding, project logistics, and relocation management companies in KSA.<br><br>Mr. Mahgoub did his Mechanical Engineering at one of the renowned universities of Sudan and started his professional career at Al-Saif Transport Company. Utilization of mechanical expertise in the management of transportation. This is because 40% of the revenue is spent on maintaining the vehicles, which saves a lot of effort/resources that otherwise would have been wasted. Al-Saif Transport reached new heights thanks to his efficiency, reliability, and right decisions.<br><br>In 2021, he started Amaken Transport Co. with Mr. Ahmad Alsaif and set high standards in the transportation industry of KSA by joining as General Manager of Amaken Transport Company. Since joining, he has grown the company by 100% in the first year.<br><br>He is focused on improving the customer experience and strengthening Amaken’s core transportation business, while also working to lead the transformation of personal mobility through advanced technologies.</p>",
        "image": "/assets/img/team/boss.jpg",
        "country": "SUDAN",
        "experience": "20+",
        "language": "Arabic, Engish"
      },
      {
        "id": "2",
        "name": "IBRAHIM MOHAMMED",
        "title": "Operation Manager",
        "quote": "A passionate and hardworking person who ignores the reality of the world with his hands-on experience and belief that no one can reach his heights. A passion for becoming the next leader in the industry is the only thing he cares about. As Gandhi said, “Be the change you want in the World”. Mr. Ibrahim Mohammed is the change we need in this world. ",
        "phone": "+966541571999",
        "email": "ibrahim.mohamed@amakentransport.com",
        "paragraph": "<p>Self-motivated professional with 14+ years of experience in Operation & Transpiration areas. Extensive experience in general Operation & Logistics activities, Proficient in overseeing the operation process including planning, trucking, and general Operation Hands-on experience in Operations, Adept and proficient at handling day-to-day activities in coordination with internal/external departments for smooth business operations. Proficiency in supporting and sustaining a positive work environment that fosters team performance with strong communication and relationship management skills.<br> A keen communicator and strategist with the ability to relate to people across all hierarchical levels in the organization.</p>\n<ul class=\"bati\">\n<li>Manage contract/tender process to ensure provision and maintenance of a safe working environment within Planning & Operations Development.</li>\n<li>Meets work standards by following operations control, quality, and customer-service standards; resolving operational problems identifying work process improvements.</li>\n<li>Manage the development of customer focused service and `a positive corporate image, including the maintenance of good working relationships with working relationships with Board members, staff, Unions and the general public</li>\n<li>Responsible for sulfur loading and transportation projects for Aramco Co..</li>\n<li>Inbound and Outbound shipping and Transportation and following Aramco procedures and operations prepared the requirements. </li>\n<li>Motivations and following shipping team and ensuring the plans.</li>\n<li>Development of the follow - up trucks department of the company through</li>\n<li>Design GPS Tracking Program</li>\n</ul>",
        "image": "/assets/img/team/ibrahim.jpg",
        "country": "Egypt",
        "experience": "14+ ",
        "language": "Arabic, Engish"
      },
      {
        "id": "3",
        "name": "KASHIF IMRAN",
        "title": "Regional Manager",
        "quote": "",
        "phone": "+966542564999",
        "email": "kashif@amakentransport.com",
        "paragraph": "<p>Mr. Kashif Imran is working as Operation Manager Riyadh Branch in Amaken Transport. One of the leading national freight forwarding, project logistics, and relocation management companies in KSA. <br><br>  Mr. Kashif Imran has a Master’s in Business Administration from one of the renowned universities of Pakistan. Started his professional career at Al-Saif Transport Company as a Dammam port supervisor in 2001. From 2001 to 2005, Mr. Kashif Imran executed all the roles with dedication. He ensured that Safety and smooth operations were executed on the port premises. <br><br> Because of his outstanding performance, he was promoted as the Jubail Branch Manager where he spent a decade building that branch from the ground and achieving the targets in an exemplary way. He worked in Jubail as the branch manager from 2005 to 2017 on the SABIC & HADID project. <br><br> In 2017, he was promoted again and became Assistant Operation Manager. Furthermore, worked as a Project Manager on the project outsourced by ARAMCO to Al-Saif Transport Company. He managed a Fleet of 152 Vehicles for the ARAMCO project.<br><br> In 2021, Mr. Kashif Imran said farewell to Al-Saif Transport Company and Joined Amaken Transport Company as Operation Manager for the Riyadh branch.</p>",
        "image": "/assets/img/team/mamu.jpeg",
        "country": "Pakistan",
        "experience": "20+",
        "language": "Urdu, Arabic, English"
      },
      
      {
        "id": "4",
        "name": "HANI MOSTAFA",
        "title": "Accounts Manager",
        "quote": "Experienced Accountant with 20+ years of experience in Finance, Accounting, and Asset Management combined with a solid understanding of legal procedures and legislation.",
        "phone": "+966569288586",
        "email": "accountant@amakentranpsort.com",
        "paragraph": "<p>Mr. Hani Mostafa has ACCA Degree from Egypt and has 20+ years of experience in the field of Accounting and Finance. He has worked in many international firms as an accountant and CFO. He implemented the accounting System in the Amaken Transport Co.  He trains the new employees for their role in the office. He worked in Osool United Group as Acting Chief Financial Officer, Internal & External Reporting, Developing Accounting, and Operation Cycles in Cairo, Egypt.<br><br>\nMr. Hani was responsible for the preparation and reconciliation of (the VAT) declaration and coordinated and completed annual audits. In Osool United. He also implemented Microsoft Dynamics 360 for Al-Saif Transport and worked as the Section Head of the Company.  </p>\n",
        "image": "/assets/img/team/hani.jpg",
        "country": "Egypt",
        "experience": "20+",
        "language": "Arabic, Engish"
      }
    
    ]